
// Ionic & system imports
import { IonButton, IonCard, IonCardContent, IonCardHeader, IonCardTitle, IonCheckbox, IonCol, IonContent, IonGrid, IonIcon, IonImg, IonInput, IonItem, IonLabel, IonList, IonModal, IonPage, IonRow, IonText, IonTitle, IonToolbar, } from '@ionic/react';

// Backend & authentication related imports
import '../test-credentials.ts';
import { getAuth, createUserWithEmailAndPassword } from "firebase/auth";
import { app } from '../test-credentials';
import validator from 'validator';
import {rpc} from '../rpc'

// UI logistics imports
import './SignUp.css';

/* Core CSS required for Ionic components to work properly */
import '@ionic/react/css/core.css';

/* Basic CSS for apps built with Ionic */
import '@ionic/react/css/normalize.css';
import '@ionic/react/css/structure.css';
import '@ionic/react/css/typography.css';

/* Optional CSS utils that can be commented out */
import '@ionic/react/css/padding.css';
import '@ionic/react/css/float-elements.css';
import '@ionic/react/css/text-alignment.css';
import '@ionic/react/css/text-transformation.css';
import '@ionic/react/css/flex-utils.css';
import '@ionic/react/css/display.css';

/* Theme variables */
import '../theme/variables.css';
import { mail, lockClosed, chevronForward, person, call } from 'ionicons/icons';
import { useEffect, useState } from 'react';

const SignUp: React.FC = () => {
    const [name, setName] = useState<string>("");
    const [email, setEmail] = useState<string>("");
    const [pass, setPass] = useState<string>("");
    const [checked, setChecked] = useState(false);
    const [error, setError] = useState("");

    /* firebase code */

    const auth = getAuth(app);
    async function handleSubmit(){
      if(checked && (validator.isEmail(email))){
        try {
          const createdUser = await createUserWithEmailAndPassword(auth, email, pass)

          const userObject = {
            full_name: name,
            email: createdUser.user.email,
            firebase_token: createdUser.user.uid
          }

          await rpc.auth.userAuth(userObject);

          window.location.reload();

        } catch(e) {
          console.log(e)
        }
      }
      if(!checked){
        setError("יש לאשר את תנאי השימוש")
      } 
      if(!validator.isEmail(email)){setError("כתובת אימייל לא תקינה")}
      if(pass.length < 6){setError("סיסמה קצרה מדי")}
      
      
    }


  const [showModal, setShowModal] = useState(false);
  return (
    <IonPage>
        <IonToolbar>
            <IonButton href="/login" className="topBackBtn" fill="clear">
                <IonIcon color="primary" slot="icon-only" icon={chevronForward} />
            </IonButton>
        </IonToolbar>
      <IonContent fullscreen>
      <IonModal isOpen={showModal} cssClass='my-custom-class'>
        <IonContent>
      <IonCard>
              <IonCardHeader>
                  <IonCardTitle>תנאים כלליים</IonCardTitle>
              </IonCardHeader>
              <IonCardContent>
                  
              שימוש ביישום &quot;My Dojo&quot;

1. כללי
1.1. יישום זה בבעלות ומופעל על ידי איתי ענבר (להלן &quot;היישום&quot; ו- &quot;אנו&quot;), שכתובתו
האלקטרונית היא:appmydojo@gmail.com לשם קבלת פניות אלינו ביחס ליישום.
1.2. השימוש ביישום וכל הנלווה לו כפוף לתנאים המנויים מטה. אנא קרא/י בעיון תנאים אלו. אם
אינך מסכים/ה לתנאי מתנאים אלו, הנך נדרש/ת שלא לעשות שימוש ביישום. שימושך
ביישום, ייחשב על כן, להסכמה לתנאים אלו.
1.3. אם אינך בגיל חוקי, המאפשר לך להתחייב ולקבל תנאים אלו, אל תשתמש/י ביישום זה.
אם יסתבר לנו, כי אינך בגיל חוקי מתאים כאמור, אנו שומרים לעצמנו האפשרות למנוע
ממך שימוש ביישום או בחלקיו.
1.4. מטעמי נוחות הפנייה במסגרת יישום זה היא בלשון זכר יחיד, אולם היא מיועדת לנשים
וגברים כאחד, יחיד ורבים.
1.5. סטייה ולו חלקית מתנאי השימוש של היישום עלולה להסתיים בחסימה, או בהגבלת
השימוש באתר או חשבונך לרבות ביטולו על ידינו. מוסכם בין הצדדים כי כל הפרה של
תנאי מתנאי שימוש אלו מהווה הפרה יסודית של תנאים אלו.
1.6. ככל שנהיה בדעה כי הפרת את תנאי שימוש אלו, אתה מתחייב להסיר לבקשתנו את
היישום ממכשירך.
1.7. מדיניות הפרטיות שביישום מהווה חלק בלתי נפרד מתנאי שימוש אלו.
2. מהות היישום
2.1. היישום מנגיש למשתמשיו תכנים שונים בתחום אמנויות הלחימה.
2.2. היישום אינו מהווה תוכנית אימון סדורה מכל סוג שהוא. הוא אינו מתיימר להוות פתרון
נפשי, גופני או רפואי לדבר. המופיע ביישום אינו מותאם דווקא למשתמש כלשהו, אלא עשוי
להיות מתאים לבעלי מיומנויות גבוהות בלבד בתחום אמנויות הלחימה. עליך להתייעץ עם
מאמן מוסמך בתחום אמנויות הלחימה בטרם תנסה ליישם מערכי אימון, תרגילים וכיוב&#39;
פעילויות המופיעות ביישום. כמו כן, אם הינך סובל מבעיות בריאותיות, עליך להתייעץ עם
איש מקצוע בתחום זה בטרם כל פעילות.
2.3. לא כל הפעילויות הנוגעות ליישום מתאימות לכל אדם, אנא הפעילו שיקול דעת בעת שאתם
משתמשים ביישום. השימוש ביישום הוא על אחריותך המלאה.
2.4. היישום מותר לבני 18 שנים ומעלה בלבד. שימוש בישום על ידי מי שצעיר מגיל 18 כפוף
לאישור מאת האפוטרופוס החוקי שלו.
2.5. הישום ניתן להורדה בחנויות האפליקציות שאנו בחרנו להפיץ את היישום באמצעותן.
2.6. ההסכמים שבינך לבין חנות האפליקציות עשויים לחול גם ביחס לשימוש ביישום ולתשלומים
עבורו בנוסף על תנאי שימוש אלו. הפרת ההסכמים עם חנות האפליקציות לפי ראות עיני
חנות האפליקציות עלולה למנוע ממך את השימוש ביישום, והינך מתחייב לכבד הסכמים
אלו.
2.7. לצורך שימוש ביישום עליך על חשבונך: להצטייד במכשיר העונה על הדרישות המינימליות
הטכניות של היישום ולחבר את מכשירך אל רשת האינטרנט.

3. פתיחת חשבון
3.1. לשם השימוש ביישום, תידרש לפתוח חשבון במסגרת היישום, הכרוך בשם משתמש
ובסיסמא. רק אדם מעל גיל 18 מורשה לפתוח חשבון לצורך היישום. אפוטרופוס יכול
לפתוח חשבון עבור בן חסותו. אנו יוצאים מתוך הנחה, כי חשבון על שם מי שהוא מתחת

לגיל 18, נפתח עלי די האפוטרופוס שלו או באישורו; ככל שיסתבר לנו שאין אלו פני
הדברים, אנו שומרים על זכותנו לסגור את החשבון.
3.2. עליך לשמור בסודיות את שם המשתמש והסיסמא.
3.3. הינך מחויב להודיע לנו באופן מיידי, אם את/ה חושד/ת שמישהו עושה שימוש בלתי מורשה
באמצעות חשבונך אצלנו.
3.4. אנו לא נהיה אחראים לשימוש בלתי מורשה של צדדים שלישיים בחשבונך ולתוצאות שימוש
בלתי מורשה זה.
3.5. מבלי לגרוע מכלליות תנאים אחרים, הינך מתחייב, כי הינך בן 18 ומעלה ושהפרטים שהינך
מוסר לנו לצורך פתיחת החשבון הינם אמיתיים, עדכניים ומדויקים.
3.6. אינך מורשה לאשר לאחר לעשות שימוש בחשבונך.
3.7. יתכן שהיישום יאפשר פתיחת חשבון באמצעות פלטפורמות אחרות שבהן קיים חשבון על
שימך, כגון: פייסבוק וגוגל פלוס. אף במקרה זה עליך לוודא שהפרטים והתכנים כגון:
תמונתך, המועברים מפלטפורמות אלו הינם נכונים ומדוייקים; הינך מעניק לנו בהשתמשך
באופציה זו לעשות שימוש במסגרת היישום בכל אותם פרטים ותכנים בהתאם לתנאי
שימוש אלו, לרבות פרסומם ביישום.
3.8. הינך רשאי בכל עת להודיע על בקשתך כי חשבונך יוסר מהיישום על ידנו.
3.9. הסרת חשבונך עלולה להוביל לאובדן כל המידע שנשמר בחשבונך.
4. ניהול היישום ושימוש בו
4.1. אנו שומרים לעצמנו הזכות לשנות את היישום, לעצבו מחדש, להוסיף או לגרוע ממנו, ללא
אישור ממך.
4.2. הינך מתחייב/ת שלא להתערב בפעולתו של היישום על כל חלקיו, שלא לצור עומס על
מערכות היישום, ושלא לבצע כל מעשה שיש בו כדי לפגוע בשימושם של אחרים ביישום או
בפעילותו השגרתית.
4.3. השימוש ביישום נועד לשימוש אישי, פרטי, סביר והוגן. הפעלה בפומבי של היישום עבור
קבוצת אנשים איננה מותרת.
4.4. השימוש ביישום מותנה בכך שהינך באופן כנה מעוניין להתנסות באמנויות לחימה. &quot;דייג
נתונים&quot; או בדיקות שיווקיות, סטטיסטיות או מחקריות אחרות אסורים באמצעות יישום זה..
4.5. אל לך לעשות דבר שיש בו להוות עקיפה של תנאי שימוש אלו או של מנגנונים טכנולוגים
הקיימים ביישום או כדי לסייע לדבר, או כשיש בו כדי לפגוע או להתערב בפעולת מערכות
היישום, תכונותיו, יישומיו, וכיוב&#39; מאפיינים הקיימים ביישום. אנו נהיה רשאים להגביל
שימושך ביישום ככל שיתעורר חשד אצלנו למעשים מסוג זה.
4.6. אל לך לעשות שימוש בכל כלי, תוכנה, מערכת, אלגוריתם, רובוט, שיטה, אמצעי אוטומטי
או מתוכנת אחר למעט מערכת ההפעלה הסטנדרטית של אנדרואיד או אפל על מנת לגשת
אל היישום. אין להעתיק תכנים מהיישום באמצעים אלו ואין לחדור באמצעותם ליישום או
אל מנגנוניו, ואין לעשות כל שימוש או העתקה של הקוד המוטמע בו.
4.7. אינך מורשה לבצע כל שימוש בתכנים המופיעים ביישום ללא אישור מפורש ובכתב מעימנו.
4.8. על אף שאנו נוקטים בצעדים שונים על מנת לשמור על המידע המועלה על ידך ליישום,
איננו יכולים להיות ערבים, כי לא תהיה חדירה בלתי מורשית אל המידע הנ&quot;ל, והינך
לוקח/ת את כל הסיכונים הכרוכים בהעלאת מידע זה. כמו כן, איננו ערבים לכך שלא תהא
חדירה בלתי מורשית למערכות היישום או למערכות אחרות שלנו.
4.9. אנו רשאים לסגור את היישום, למכרו למפעילים אחרים, לשנות את ייעודו, להפוך חלקים
מהיישום או את כולו לנגישים לקבוצה מצומצמת יותר.
4.10. אנו רשאים להתנות בתשלומים נוספים גישה לחלקים מהיישום או לכולו, או להתנות
בתשלום שימוש בתכונות, שירותים או אמצעים הקיימים בו כעת ללא בתשלום או ללא
תשלום נוסף.

4.11. אנו רשאים להפסיק את התמיכה האנושית ו/או האוטומטית אשר מספק היישום בחלקים
ממנו, להפסיק זמנית או באופן קבוע קיומם של שירותים מסויימים, תפקודים שונים או
חלקים מהיישום, והנך מאשר/ת כי אין לך ולא תהיה לך כל טענה כנגדנו בשל זאת.
4.12. אנו מעת לעת עשויים לפי שיקול דעתנו המוחלט להפיץ עדכונים ליישום, שהורדתם על ידך
מחנות האפליקציה חיונית לשם הנאה מלאה מהיישום.
5. קניין רוחני
5.1. כל זכויות היוצרים הכרוכים ביישום ובמה שמצוי בו לרבות סימני מסחר, וידאו, מוזיקה,
תמונות, עיצובים גרפיים, עימוד היישום, סידור התכנים וכיוב&#39;, שייכים לנו או לאחרים,
שנתנו לנו רשות בהם. הנך מתחייב/ת שלא לשנות, להתערב, להעתיק, לשכפל, להנדס
לאחור, להעביר, לשתף, לשלב, להשתמש לצורך מסחרי, לשדר, להציגו בפומבי, לעבד או
להפיץ כל חלק מהיישום או תוכן המצוי בו.
5.2. אינך מורשה/ית ליצור קישוריות LINK אל היישום מיישום אחר, או לבצע כל סוג של מסגור
(FRAMING) או הטמעה (EMBEDING) ביישום אחר ביחס לתכני יישום זה.
5.3. הביטוי &quot;_My Dojo_&quot; והלוגו הנלווה לו, הינם סימני מסחר שלנו. הינך מתחייב/ת שלא
לעשות בהם כל שימוש ללא אישור מפורש ובכתב שלנו.
5.4. ביישום ניתן לך רישיון שימוש זמני, בלתי אקסלוסיבי, בלתי ניתן להעברה, המוגבל להורדתו
למכשיר אחד בלבד ולהתקנתו במכשיר זה, הכול בכפוף לתנאי שימוש אלו.
5.5. ככל שנאפשר לגולשים להשיא לנו עצות והצעות לשיפור המוצר או לשינויו, הרי ככל שניישם
עצה או הצעה הרי מלוא הזכויות ביישום העצה או הצעה יהיה שייך לנו בלבד, ולא תהא לך
כל דרישה או טענה או זכות ביישומים אלו.
6. פירסומות ממומנות
הינך מסכים/ה להיות חשוף לפרסומות ממומנות שונות, שיופיעו ביישום לרבות פרסומות,
שתהיינה צמודות לתוכן/הודעות המועלה על ידך ליישום. פירסומות אלו הינן על דעתם של
המפרסמים בלבד ואין אנו אחראים לתוכנן או לטיבן.
7. אחריות ושיפוי
7.1. יישום זה על כל חלקיו, תכונותיו, ישומיו, שירותיו ותכניו, הינו כמו שהוא וללא כל אחריות.
אנו איננו מבטיחים ביחס ליישום וחלקיו: זמינות מלאה, תפקוד תקין או תפקוד כלשהו,
העדר תקלות או הפרעות לרבות מחיקת מידע וקריסה, יעילות, היקף חשיפות, הופעה
נאותה בכל הדפדפנים, המסכים או ההתקנים או כל מימד אפקטיביות אחר או כי המידע בו
מדוייק, או נטול טעויות. אין אנו מבטיחים, כי ניתן להסתמך על המופיע ביישום או על
שירותיו. אנו דוחים כל טענה בדבר כשירות היישום או התאמתו למטרות מסוימות. השימוש
ביישום הוא באחריותך בלבד. אנו בכל מקרה, לא נהיה אחראים: לכל נזק תוצאתי או עקיף,
להפסדים ולאובדן מידע.
7.2. למרות שהננו נוקטים באמצעי אבטחה ביישום, אנו לא נישא בכל אחריות למעשה פריצה
ליישום ונטילת תכנים ונתונים ממנו, או שיבושו.
7.3. אין לנו, לעובדינו, למנהלינו, לדירקטורים שלנו ולבעלי מניותינו כל אחריות לנזקים ישירים או
עקיפים או תוצאתיים או עונשיים הנובעים משימוש לא מורשה של מאן דהוא ביישום. מלוא
הסיכון הנובע מתוך השימוש ביישום לרבות השימוש בתכנים המצויים בו או במוצרים או
השירותים המפורסמים בו או המוצעים באמצעותו או בעטיו הוא עליך בלבד, ואין לנו כל
אחריות לדבר. בשום מקרה לא נהיה אחראים לכל נזק או הוצאה או הפסד או אי נוחות או
אובדן מידע או צער וסבל כתוצאה מהשימוש כאמור.

7.4. את/ה תשפה אותנו, עובדינו, מנהלינו, דירקטורים שלנו ובעלי מניותינו בגין כל תביעה או
דרישה של צד ג&#39; הנובעת משימושך ביישום או בכל הנוגע לשירות או מוצר שפורסמו
במסגרתו או שפורסמה בקשה לקבלת הצעות במסגרתו או שימוש בהם. אנו נעשה מיטב
מאמצינו להודיע לך בהקדם אודות או תביעה או דרישה כאמור, ונאפשר לך להתגונן בפניה.
ככל שלא תתגונן/י כנדרש אנו עשויים לעשות כן במקומך ואת/ה תישא בכל הוצאותינו בנדון
כמו אף בכל תוצאות ההליך או הפשרה ככל שנגיע אליה בהקשר זה.
7.5. הפרת תנאי שימוש אלו על ידך, תזכה אותנו בתשלום פיצויים בין היתר בהתאם לנזקים,
ההפסדים, ההוצאות, הטרחה, ההטרדה, עוגמת הנפש שהוסבה לנו לציבור המשתמשים
ביישום ולאחרים.
שונות
7.6. הנמנעות מלנקוט בצעד כלשהו שאנו זכאים לנקוט בו, לא יהווה ויתור או השתק.
7.7. אם תנאי מתנאי השימוש ביישום זה ימצא כלא תקף או לא אכיף, אזי אותו תנאי יאכף עד
להיקף המותר על פי הדין, ואין בכך כדי לפגוע בתוקפם ואכיפותם של יתר תנאי השימוש
ביישום זה.
7.8. אנו רשאים מעת לעת לשנות תנאים אלו, אנא בדוק/י את התנאים באופן מתמיד.
7.9. על תנאים אלו יחולו דיני מדינת ישראל, וסמכות השיפוט הבלעדית לדון בתנאים ובכל
הקשור לשימושך ובכל הנובע ממנו, נתונה לבתי המשפט במחוז המרכז.
7.10. כל תביעה בין הצדדים בקשר ליישום זה תוגש תוך שנה מיום קרות עילת התביעה.
7.11. אין את/ה רשאי/ת להסב כל זכות שקמה לך כלפינו בקשר ליישום. אנו רשאים להסב
זכויותינו וחובותינו לאחרים.
7.12. תנאים



              </IonCardContent>
          </IonCard>
          <IonCard>
              <IonCardHeader>
                  <IonCardTitle>מדיניות פרטיות</IonCardTitle>
              </IonCardHeader>
              <IonCardContent>
                  
              מדיניות פרטיות – ליישום - My Dojo

גרסה: נובמבר 2020

1. כללי
1.1. פרטיותך חשובה לנו, ואנו מעוניינים להיות שקופים באשר לאופן בו אנו עושים שימוש במידע.
1.2. אנו, איתי ענבר (להלן: &quot;אנו&quot;) מפעילים את הישום My Dojo (להלן: &quot;היישום&quot;).
1.3. מדיניות פרטיות זו מתארת את האופן שבו אנו משתמשים במידע שנמסר לנו על ידי הגולשים
ביישום, או שנאסף על ידינו או על ידי צדדים שלישיים, (להלן – &quot;המידע&quot;).
1.4. נבקשך לקרוא את מדיניות זו עד סופה. אם אינך מסכים לתנאיה, הינך מתבקש לצאת מהיישום
ולא לעשות בו כל שימוש. ככל שבחרת להמשיך ולגלוש ביישום או לעשות בו כל שימוש אחר, הינך
נחשב למי שנתן הסכמתו למדיניות זו.
1.5. מדיניות זו נוקטת בלשון זכר מטעמי נוחיות אולם היא פונה לשני בני המינים.

2. המידע שאנו אוספים באמצעות היישום:
2.1. מידע נמסר לנו במסגרת הרשמה ליישום או מילוי טפסים ביישום, כגון: שם, מספרי קשר, כתובת
פיסית, תמונה, מספרי טלפון, כתובת מייל, סיסמאות, שמות משתמש, מספרי זהות, סוג הרכב
ופרטים אודותיו וכיוב&#39; פרטים כפי שימסרו על ידי הגולשים באמצעות היישום מעת לעת.
2.2. כאשר אתה עושה שימוש ביישום בין באמצעות מחשב, טלפון סלולארי או כל אמצעי אחר, מידע
הנובע משימושך ביישום, עשוי להיות נאסף על ידנו, כגון: תוכן שהינך מעלה ליישום, אינטראקציות
בינך לבין משתמשים אחרים ביישום או עימנו, תאריכי ושעות כניסתך ליישום, הדפים בהם
ביקרת, זמן שהייתך ביישום או בחלקיו השונים, מהלך שימושך ביישום, ההרשמות שביצעת,
פעילויות שנטלת חלק בהם ועוד. האיסוף יכול שיעשה אף באמצעות מזהים טכנולוגים המוטמעים
בציוד שאתה משתמש בו ו/או בשירותים הטכנולוגיים בהם אתה עושה שימוש כגון: כתובת IP.
2.3. אנו עשויים להשתמש ב&quot;עוגיות&quot; (cookies) או בטכנולוגיות דומות, העושות שימוש בקובץ שאנו
שולחים לאמצעי שבעזרתו את/ה מתחבר/ת ליישום. קובץ זה, אשר גלוי לנו ויש לנו רשות כניסה
אליו, אוגר מידע אודות אופן שימוש באמצעי שברשותך והדבר מסייע לנו להתאים את היישום טוב
יותר אליך. אנו עשויים לטמון בקובץ זה גם מידע משלנו לשם מטרה זו. לרוב יש לך האופציה
לחסום את השימוש ב&quot;עוגיות&quot; באמצעות התוכנה שבעזרתה את/ה גולש/ת ליישום, אבל הדבר
עלול לפגוע באופן השימוש ביישום.
2.4. אנו עשויים לקבל מידע משירותים מקוונים כגון Google Analytics , פייסבוק, אינסטגרם ושירותי
נוספים של גוגל אשר עוקבים אחרי פעילותך ברשת ועשויים לספק לנו פרטים אודות מיקומך, זמני
כניסתך ליישום, שהייתך בחלקיו השונים, אופן שימושך ביישום ומאפייניך כפי שנאספו על ידם, כמו
אף להעביר אלינו מידע שנמסר על ידך לשירותים ואשר שירותים אלו מוסדרים בהתאם למדיניותם
מידע זה לצדדים שלישיים.

2.5. אנו עשויים לעשות להשתמש במידע שנמסר לנו על ידי צדדים שלישיים אודותיך כגון המועדון
אמנויות הלחימה שבו הינך מתאמן, שעל פי הצהרתם הענקת להם רשות להעביר אלינו מידע זה,
לדוגמא: כתובות דואר אלקטרוניות של מתאמנים במועדון מסויים.

3. כיצד אנו משתמשים במידע?
אנו משתמשים במידע שאנו אוספים למטרות הבאות:
• הפעלת ותחזוקת היישום - באמצעות המידע שאנו אוספים, אנו יכולים לקיים את הפעילויות
שביישום.
• למסור לך הודעות על שינויים ביישום.
• לשם שיתוף פרטים החיוניים לדעתנו לצרכי היישום עם משתמשים אחרים ביישום.
• לאפשר לך להנות מתכונות אינטראקטיביות של היישום כאשר אתה בוחר לעשות כן, ככל
שהן זמינות.
• לשם ביצוע ניתוחים על מנת שנוכל לשפר ולפתח את היישום, ולהציג בפניך מידע באופן
התואם יותר את מאפייניך והעדפותיך האישיות.
• לבחון לשם ניתוח השימושים ביישום כיצד נעשה שימוש ביישום.
• לשם זיהוי, מניעה וטיפול בבעיות טכניות.
• לשם התאמת היישום להעדפותיך ולמאפייניך האישיים. באופן זה יתכן שהיישום יוכל לזהות
אותך עם כניסתך אליו, ולהציג בפניך מידע ותכונות המותאמים למידע שנאסף אודותיך באופן
פרטיקולרי.
• לשם קידום הבטיחות והאבטחה של היישום ושל המשתמשים שלנו.
• לשם הגנה על זכויותינו המשפטיות.
• לשם מניעת מעשי הונאה או פעילות אסורה, וכן לצורך אכיפת תנאי השימוש ביישום.
• לשם בחינת עמידת המשתמשים ביישום בהתחייבויותיהם כלפינו ולשם פתרון סכסוכים.
• לצרכי מחקר וסקרים.
 לצרכי מתן שירות ומידע לגולשינו ולקוחותינו.
 לצרכי פעילויותינו השיווקיות והמכירתיות.
 לשם העברת וחשיפת התוכן שהינך מעלה ואופן שימושך ביישום למשתמשים אחרים ביישום.
משמעות הדבר היא שאנו יכולים לגשת למידע בזמן אמת, לשמור אותו, לאחסן בארכיון, לנתח,
לשנות, לשלב אותו עם מידע אחר שיש לנו ממקורות אחרים, כולל מידע אודותיך מצדדים שלישיים.

4. כיצד אנו משתפים במידע?
4.1. אנו רשאים לשתף באופן חופשי עם צדדים שלישיים מידע שנאסף באמצעות היישום, שאין בו כדי
לזהותך.
4.2. אנו משתפים עם משתמשים אחרים ביישום פרטים אודותיך ואודות אופן שימושך ביישום,
כגון: פרופיל חשבונך, תכנים שהעלת ליישום ואופן שימושך ביישום.
4.3. למעט האמור לעיל איננו משתפים עם אחרים את המידע היכול להיות מזוהה עימך, (להלן –
&quot;מידע מזהה&quot;) למעט כמפורט להלן:
אנו נהיה רשאים לשתף מידע מזהה עם צדדים שלישיים לצורך העניינים הבאים:
 הגנה על זכויותינו החוקיות.
 כאשר אנו נדרשים לעשות כן על פי הוראה של רשות בת סמכא.
 לשם מניעת נזק לך או לצד ג&#39; או לשם סיוע לו.

 במקרים אחרים, כאשר ניתנה לנו רשות מפורשת ממך לבצע את השיתוף.
 כאשר נעביר את פעילותינו לגורם אחר או נתמזג עימו.
במקרים של שיתוף כאמור, אנו נעשה את מיטב מאמצינו כי ישותף רק אותו חלק חיוני מהמידע
אשר נדרש לצורך העניינים שלעיל.
5. זכויותיך ביחס למידע המזהה
5.1. הינך רשאי לפנות אלינו, כדי לדעת איזה מידע מזהה אודותיך מצוי ברשותנו.
5.2. ככל שמצאת שמידע זה אינו מדוייק תהיה רשאי לבקש מעימנו לתקנו.
5.3. הינך רשאי לבקש מעימנו מחיקתו של מידע מזהה אודותיך, ואנו נעשה מאמצים סבירים לעשות
כן, בכפוף לשמירה על אינטרסים לגיטימים שלנו הנוגעים לפעילותינו החוקית או להגנה על
זכויותינו החוקיות.

6. שמירת המידע
6.1. אנו שומרים את המידע נשוא מדיניות זו למשך הזמן הנדרש לצורך ביצוע פעילויותינו הלגיטימיות
כעסק מסחרי ולשם הגנה על זכויותינו המשפטיות ואינטרסים לגיטימיים שלנו.
6.2. אנו נוקטים באמצעי הגנת המידע המקובלים בשים לב לרגישותם ולהיקפם, לשם שמירה על
מערכותינו ועל המידע האצור בהן. יחד עם זאת, הגנה מוחלטת אינה בת השגה, ואיננו יכולים
להבטיח לחלוטין, כי לא תתרחש פריצה למערכותינו ולא תתקיים גישה בלתי מורשית למידע שבהן
– ככל שכך יקרה אנו נעשה את מיטב המאמצים על מנת לדווח לך אודות המקרה, במידה
שפרטיך שמורים אצלנו וישנו חשש כי היתה גישה בלתי מורשית למידע מזהה אודותיך.

6.3. איננו מחויבים לשמור את המידע ואנו רשאים למחוק אותו בכל עת.

7. שונות
7.1. למען הסר ספק יובהר, כי אין בהוראות פרק זה כדי לגרוע ו/או למצות מזכויותינו לאסוף, להשתמש
ו/או למסור מידע על פי כל דין, וכי הוראות פרק זה באות להוסיף על הוראות כל דין.
7.2. למען הסר ספק, אין באמור לעיל כדי למנוע מעימנו להיענות לכל הוראה מאת רשות מוסמכת
למסור ולהעביר אליה מידע אודותיך.
7.3. אנו רשאים לעדכן ולשנות מדיניות פרטיות זו בהתאם לשיקול דעתנו ובכפוף לדין. במקרה זה,
נעשה מאמצים סבירים להודיעך אודות כל שינוי מהותי במדיניות זו באמצעים אלקטרוניים ככל
שיש בידנו פרטי קשר נאותים שלך. אנא הכנס מעת לעת למדיניות זו כדי ללמוד אודות תכניה
העדכניים.


              </IonCardContent>
          </IonCard>
          </IonContent>

        <IonButton onClick={() => setShowModal(false)}>סגור</IonButton>
      </IonModal>
          <IonGrid className="ccontainer">
            <IonRow>
              <IonCol>
                <IonTitle className="title" size="large">הירשם</IonTitle>
              </IonCol>
            </IonRow>
            
              <IonRow>
                <IonCol pull="2" size="8">
                  <IonInput color="primary" type="text" value={name} placeholder=" שם מלא" onIonChange={e => setName(e.detail.value!)}>
                  <IonIcon size="small" color="secondary" icon={person}></IonIcon>
                  </IonInput>
                </IonCol>
              </IonRow>
            
              <IonRow>
                <IonCol pull="2" size="8">
                  <IonInput color="primary" type="email" value={email} placeholder=" כתובת דוא״ל" onIonChange={e => setEmail(e.detail.value!)}>
                  <IonIcon size="small" color="secondary" icon={mail}></IonIcon>
                  </IonInput>
                </IonCol>
              </IonRow>
              <IonRow>
                <IonCol pull="2" size="8">
                  <IonInput color="primary" value={pass} type="password" placeholder=" סיסמה" onIonChange={e => setPass(e.detail.value!)}>
                  <IonIcon size="small" color="secondary" icon={lockClosed}></IonIcon>
                  </IonInput>
                </IonCol>
              </IonRow>
              <IonRow>
                    <IonCol className="ion-align-self-center" size="3" pull="2" >
                            <IonCheckbox checked={checked} onIonChange={e => setChecked(e.detail.checked)} />
                    </IonCol>
                    <IonCol className="ion-align-self-center">
                            <IonRow>
                                <IonCol>
                                    <IonText>אני מסכים ל
                                    <a onClick={() => setShowModal(true)}>תנאי השימוש</a>
                                    </IonText>
                                </IonCol>
                            </IonRow>
                    </IonCol>
              </IonRow>
              <IonRow>
                <IonCol pull="2" size="8" className="center">
                  <IonButton onClick={handleSubmit} expand="block" color="primary">הרשמה</IonButton>
                </IonCol>
              </IonRow>
              <IonRow>
                <IonCol className="googleRow">
                <div className="center">{error}</div>
              </IonCol>
              </IonRow>
          </IonGrid>
      </IonContent>
    </IonPage>
  );
};

export default SignUp;
